cask_args appdir: '/Applications'

tap "hashicorp/tap"

brew 'wget'
brew 'awscli'
brew 'hashicorp/tap/terraform'
brew 'colima'
brew 'docker'
brew 'docker-compose'
brew 'docker-credential-helper'
brew 'imagemagick'
brew 'rbenv'
brew 'ruby-build'
brew 'spaceman-diff'
brew 'yt-dlp'
brew 'python3'
brew 'openjdk@17'
brew 'cmake'
brew 'pandoc'
brew 'weasyprint'
brew 'ffmpeg'
brew 'gpg'
brew 'free'
brew 'nvm'

cask 'android-platform-tools'
cask 'raycast'
cask 'warp'
cask 'visual-studio-code'
cask 'vlc'
cask 'zed'
cask 'container'
cask 'github-copilot-for-xcode'
cask 'ngrok'

cask 'librewolf' 
# alternative (because of https://librewolf.net/docs/faq/#why-is-librewolf-marked-as-broken) 
# brew install librewolf --no-quarantine


#cask 'metasploit' --> review this and move it inside of a container base approach using `container` setup